ERROR_LIMIT_MAX_PLAYERS = (
    "Количество игроков в группе должно быть не больше {}, указано {}."
)


ERROR_MAX_PLAYERS_IN_FUTURE = "Со следующими днями может возникнуть проблема, что будет больше людей, чем нужно на тренировке:"
ERROR_CANT_ADD_NEW_TRAIN = "Нельзя добавить тренировку на это время в этот день, т.к. уже есть запись на {} с продолжительностью {}."
CANCEL_TRAIN_PLUS_BONUS_LESSON_2 = "Тренировка отменена 😭\n{date_info}"
TRAIN_IS_AVAILABLE_CONGRATS = "Тренировка доступна, ура!\n{date_info}"
