from_eng_to_rus_day_week = {
    'Sunday': 'воскресенье', 'Monday': 'понедельник', 'Tuesday': 'вторник', 'Wednesday': 'среда',
    'Thursday': 'четверг', 'Friday': 'пятница', 'Saturday': 'суббота'
}
from_digit_to_month = {
        1: 'Январь', 2: 'Февраль', 3: 'Март', 4: 'Апрель', 5: 'Май', 6: 'Июнь',
        7: 'Июль', 8: 'Август', 9: 'Сентябрь', 10: 'Октябрь', 11: 'Ноябрь', 12: 'Декабрь',
    }

BACK_BUTTON = '⬅️ назад'

TAKE_LESSON_BUTTON = 'Записаться на занятие'
MY_DATA_BUTTON = 'Мои данные'
SKIP_LESSON_BUTTON = 'Пропустить занятие'
HELP_BUTTON = '🤓Поддержка'

NO_PAYMENT_BUTTON = '❌НЕ ОПЛАЧЕНО❌'
SUCCESS_PAYMENT = '✅ОПЛАЧЕНО✅'

NOW_YOU_HAVE_ACCESS_CONGRATS = 'Теперь тебе доступен мой функционал, поздравляю!'

GREEN_BALL = '🍏зелёный мяч🍏'
ORANGE_BALL = '🧡оранжевый мяч🧡'

ERROR_LIMIT_MAX_PLAYERS = 'Количество игроков в группе должно быть не больше {}, указано {}.'
ERROR_MAX_PLAYERS_IN_FUTURE = 'Со следующими днями может возникнуть проблема, что будет больше людей, чем нужно на тренирвоке'

CANCEL_TRAIN_PLUS_BONUS_LESSON = '😱ATTENTION😱\n' \
                       'У тебя есть запись на тренировку на <b> {}.</b>\n' \
                       '<b>Тренер ее отменил.</b> Но не отчаивайся, я добавлю тебе отыгрыш 🎾'

CANCEL_TRAIN_PLUS_BONUS_LESSON_2 = 'Тренировка <b>{} в {}</b> доступна, ура!'
TRAIN_IS_AVAIABLE_CONGRATS = 'Тренировка <b>{} в {}</b> доступна, ура!'

ERROR_CANT_ADD_NEW_TRAIN = 'Нельзя добавить тренировку на это время в этот день, т.к. уже есть запись на {} с продолжительностью {}.'

FIRST_TIME_GREETING = 'Привет! Я бот самого продвинутого тренера в Туле (России). ' \
                      'Для дальнейшей работы нужно указать свои контактные данные.'

FIRST_TIME_INSERT_FIRST_LAST_MAME = 'Введи фамилию и имя через пробел в формате "Фамилия Имя", например: Иванов Иван.'
FIRST_TIME_INSERT_PHONE_NUMBER = 'Введи номер телефона в формате "89991112233" (11 цифр подряд).'
WRONG_PHONE_NUMBER_FORMAT = 'Неправильный формат данных, было введено {} цифр.\nВведи номер ещё раз.'
I_WILL_TEXT_AS_SOON_AS_COACH_CONFIRM = 'Как только тренер подтвердит твою кандидатуру, я напишу.'

HELP_MESSAGE = 'По всем вопросам пиши @shamaevn.\nЖелательно описывать свою проблему со скриншотами.'
COACH_HAVE_NOT_CONFIRMED_YET = 'Тренер еще не одобрил.'

CANT_CANCEL_LESSON_TO_LATE = 'Неа, уже нельзя отменить занятие.\nКоличество часов, за которое тебе нужно отменять: {}'
OKAY_TRAIN_CANCELLED = 'Окей, занятие отменено.\n{}'

NO_PLACES_FOR_THIS_TIME_CHOOSE_ANOTHER = 'Упс, похоже уже не осталось свободных мест на это время, выбери другое.'
CHOOSE_TYPE_OF_PAYMENT = "Выбери тип оплаты"
