BACK_BUTTON = "⬅️ назад"
CANCEL_BUTTON = "❌ отменить занятие"
AVAILABLE_BUTTON = "✅ сделать доступным"
from_digit_to_month = {
    1: "Январь",
    2: "Февраль",
    3: "Март",
    4: "Апрель",
    5: "Май",
    6: "Июнь",
    7: "Июль",
    8: "Август",
    9: "Сентябрь",
    10: "Октябрь",
    11: "Ноябрь",
    12: "Декабрь",
}
DATE_INFO = "📅Дата: <b>{} ({})</b>\n" "⏰Время: <b>{}</b>\n\n"
UP_TO_YOU = "Ну как хочешь"
CONFIRM = "Подтвердить"
THIS_WAY_YEAH = "Вот так вот значит, да?"
ATTENTION = "⚠️ATTENTION⚠️"
ATTENTION_2 = "❌ATTENTION❌"

DAYS_AVAILABLE_FOR_GROUP_TRAIN = "✅ — дни, доступные для групповых тренировок."
DAYS_AVAILABLE_FOR_GROUP_CANCEL = "✅ — дни, доступные для отмены."
PAYMENT_REQUISITES = "Реквизиты: \n\n2202200316376548\n\n Сергей Николаевич Ю."

from_eng_to_rus_day_week = {
    "Sunday": "воскресенье",
    "Monday": "понедельник",
    "Tuesday": "вторник",
    "Wednesday": "среда",
    "Thursday": "четверг",
    "Friday": "пятница",
    "Saturday": "суббота",
}
